app/controllers/cat_rental_requests_controller.rb

  def create
    full_params = cat_rental_request_params.merge(requester_id: current_user.id)
    @rental_request = CatRentalRequest.new(full_params)
    if @rental_request.save
---
INSERT INTO "cat_rental_requests" ("cat_id", "end_date", "start_date", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cat_id", 2], ["end_date", Fri, 14 Apr 2017], ["start_date", Mon, 10 Apr 2017], ["status", "PENDING"], ["created_at", 2017-04-19 22:36:10 UTC], ["updated_at", 2017-04-19 22:36:10 UTC]]