app/controllers/cats_controller.rb

  def show
    @cat = Cat.find(params[:id])
    @rental_requests = @cat.rental_requests.includes(:requester)
                           .order('start_date')
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 ORDER BY start_date  [["cat_id", 1]]

  def create
    @cat = Cat.new(cat_params.merge(owner_id: current_user.id))
    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at", "owner_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    if @cat.update_attributes(cat_params)
---
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "Eats Tweety's"], ["updated_at", 2017-04-19 22:19:39 UTC], ["id", 2]]