app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    if user.save_plus_session
---
INSERT INTO "users" ("user_name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_name", "user1"], ["password_digest", "$2a$10$sUopBrirI1RKsxTQA41vmOkBnmaq1cKwNJDXToa8IidmIL.Gtsj3i"], ["created_at", 2017-04-20 00:21:38 UTC], ["updated_at", 2017-04-20 00:21:38 UTC]]